üìå 1. Create the DataFrame

In [25]:
import pandas as pd
data={
    "Rollno":[101,102,103,104,105],
    "Name":['Riya','Arjun','Sneha','Rakesh','Aditi'],
    "Age":[17,18,17,19,18],
    "Marks_math":[88,75,90,65,95],
    "Marks_Eng":[92,85,78,70,88],
    "Gender":['F','M','F','M','F'],
}
df=pd.DataFrame(data)
print(df)

   Rollno    Name  Age  Marks_math  Marks_Eng Gender
0     101    Riya   17          88         92      F
1     102   Arjun   18          75         85      M
2     103   Sneha   17          90         78      F
3     104  Rakesh   19          65         70      M
4     105   Aditi   18          95         88      F

2. Display only the names and English marks of all students.

In [26]:
print(df[['Name','Marks_math']])

     Name  Marks_math
0    Riya          88
1   Arjun          75
2   Sneha          90
3  Rakesh          65
4   Aditi          95

3. Add a new column ‚ÄúTotal_Marks‚Äù as the sum of Marks_Math and Marks_Eng.

In [27]:
df['Total_marks']=df[['Marks_math','Marks_Eng']].sum(axis=1)
df

   Rollno    Name  Age  Marks_math  Marks_Eng Gender  Total_marks
0     101    Riya   17          88         92      F          180
1     102   Arjun   18          75         85      M          160
2     103   Sneha   17          90         78      F          168
3     104  Rakesh   19          65         70      M          135
4     105   Aditi   18          95         88      F          183

4. Find the average marks in Math using a Pandas function.

In [28]:
avg=(df['Marks_math'].mean())
print(avg)

82.6

5. Display the records of all female students.

In [29]:
td=(df[df['Gender']=='F'])
print(td)

   Rollno   Name  Age  Marks_math  Marks_Eng Gender  Total_marks
0     101   Riya   17          88         92      F          180
2     103  Sneha   17          90         78      F          168
4     105  Aditi   18          95         88      F          183


6. Sort the DataFrame by Marks_Eng in descending order.

In [30]:
sd=df['Marks_Eng'].sort_values(ascending=False)
print(sd)

0    92
4    88
1    85
2    78
3    70
Name: Marks_Eng, dtype: int64

7. Replace gender values: ‚ÄúF‚Äù ‚Üí ‚ÄúFemale‚Äù, ‚ÄúM‚Äù ‚Üí ‚ÄúMale‚Äù using .map()

In [31]:
Gen=df["Gender"].map({"F":"Female","M":"Male"})
print(Gen)

0    Female
1      Male
2    Female
3      Male
4    Female
Name: Gender, dtype: object

8. Add a new column Result with value ‚ÄúPass‚Äù if Total_Marks >= 150, else ‚ÄúFail‚Äù (using apply()¬†with¬†lambda).

In [32]:
ge=df["Total_marks"].apply(lambda x:"Pass" if x>=150 else "Fail")
print(ge)

0    Pass
1    Pass
2    Pass
3    Fail
4    Pass
Name: Total_marks, dtype: object

9. Use map() to convert all names to uppercase from the Name column.

In [33]:
upper=df["Name"].map(str.upper)
print(upper)

0      RIYA
1     ARJUN
2     SNEHA
3    RAKESH
4     ADITI
Name: Name, dtype: object


10. Use filter() to get the list of students whose Marks_Math is greater¬†than¬†80

In [34]:
def get(a):
    if a>80:
        return True
l1=df["Marks_math"]
res=list(filter(get,l1))
res

[88, 90, 95]

11. Use lambda to create a new column Grade:

	‚Ä¢	A if Total_Marks ‚â• 170

	‚Ä¢	B if Total_Marks ‚â• 150

	‚Ä¢	C otherwise

In [35]:
Ab=df['Grade']=df['Total_marks'].apply(lambda x: 'A' if x >= 180 else 'c' )
print(Ab)

0    A
1    c
2    c
3    c
4    A
Name: Total_marks, dtype: object


12. Use reduce() to calculate the total of all Math marks.

In [36]:
from functools import reduce
tm=reduce(lambda x,y: x+y, df["Marks_math"])
print(tm)

413


13. Count how many students are below the age of 18.

In [37]:
def get(a):
    if a<18:
        return True
l1=(df['Age'])
res=list(filter(get,l1))
print(res)

[17, 17]

14. Create a new column Average which gives average of both subjects.

In [38]:
nc=df["Marks_math"].mean(),df['Marks_Eng'].mean()
print(nc)

(82.6, 82.6)


15. Display names of students who scored more in English than Math.

In [39]:
mm=df["Marks_Eng"] > df["Marks_math"]
print(mm,df["Name"])

0     True
1     True
2    False
3     True
4    False
dtype: bool 0      Riya
1     Arjun
2     Sneha
3    Rakesh
4     Aditi
Name: Name, dtype: object


16. Group students by Gender and calculate average marks for each gender.

In [41]:
ag=df.groupby("Gender")[['Marks_math','Marks_Eng','Total_marks']].mean()
print(ag)

        Marks_math  Marks_Eng  Total_marks
Gender
F             91.0       86.0        177.0
M             70.0       77.5        147.5

17. Find the student with the highest total marks¬†using¬†Pandas.

In [48]:
st=df.loc[df["Total_marks"].idxmax()]
print(st)

Rollno           105
Name           Aditi
Age               18
Marks_math        95
Marks_Eng         88
Gender             F
Total_marks      183
Grade              A
Name: 4, dtype: object